[
  "obsidian-kanban",
  "quickadd",
  "obsidian-advanced-slides",
  "table-editor-obsidian",
  "obsidian-auto-link-title",
  "cmenu-plugin",
  "dataview",
  "easy-typing-obsidian",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-excalidraw-plugin",
  "highlightr-plugin",
  "link-favicon",
  "number-headings-obsidian",
  "obsidian-plantuml",
  "remember-cursor-position",
  "templater-obsidian",
  "obsidian-timeline",
  "obsidian-footnotes",
  "better-fn",
  "obsidian-style-settings",
  "obsidian-minimal-settings",
  "obsidian-image-auto-upload-plugin"
]